**free
// ---------------------------------------------------------------
//  Data structure for message ID: COA0003

//  Teildatei &3 in Datei &2/&1 nicht gefunden.

dcl-ds COA0003;
  COA00031 char(0010) inz(*blanks);
  COA00032 char(0010) inz(*blanks);
  COA00033 char(0010) inz(*blanks);
end-ds;
dcl-s COA0003_SIZE int(10) inz(0030);

