**free
// ---------------------------------------------------------------
//  Data structure for message ID: COA0004

//  Objekt &1 in Bibliothek &2 Art &3 nicht gefunden.

dcl-ds COA0004;
  COA00041 char(0010) inz(*blanks);
  COA00042 char(0010) inz(*blanks);
  COA00043 char(0010) inz(*blanks);
end-ds;
dcl-s COA0004_SIZE int(10) inz(0030);

