      // ---------------------------------------------------------------
      //  Data structure for message ID: COA0002

      //  Zu viele Werte angegeben.

     d COA0002         ds
      //  No replacement variables available!
     d COA0002_SIZE    s             10I 0 inz(0000)

