**free
// ---------------------------------------------------------------
//  Data structure for message ID: COA0001

//  Die Angaben zur Quellenteildatei sind unvollstndig.

dcl-ds COA0001;
end-ds;
//  No replacement variables available!
dcl-s COA0001_SIZE int(10) inz(0000);

