      // ---------------------------------------------------------------
      //  Data structure for message ID: COA0004

      //  Objekt &1 in Bibliothek &2 Art &3 nicht gefunden.

     d COA0004         ds
     d  COA00041                   0010A   inz(*BLANKS)
     d  COA00042                   0010A   inz(*BLANKS)
     d  COA00043                   0010A   inz(*BLANKS)
     d COA0004_SIZE    s             10I 0 inz(0030)

