**free
// ---------------------------------------------------------------
//  Data structure for message ID: COA0002

//  Zu viele Werte angegeben.

dcl-ds COA0002;
end-ds;
//  No replacement variables available!
dcl-s COA0002_SIZE int(10) inz(0000);

