      // ---------------------------------------------------------------
      //  Data structure for message ID: COA0003

      //  Teildatei &3 in Datei &2/&1 nicht gefunden.

     d COA0003         ds
     d  COA00031                   0010A   inz(*BLANKS)
     d  COA00032                   0010A   inz(*BLANKS)
     d  COA00033                   0010A   inz(*BLANKS)
     d COA0003_SIZE    s             10I 0 inz(0030)

