      // ---------------------------------------------------------------
      //  Data structure for message ID: COA0001

      //  Die Angaben zur Quellenteildatei sind unvollständig.

     d COA0001         ds
      //  No replacement variables available!
     d COA0001_SIZE    s             10I 0 inz(0000)

