**free
ctl-opt copyright('V1.2 - 04.06.2026 - mailto: thomas.raddatz@tools400.de');

dcl-c CHGOBJDA_VERSION '1.2';
dcl-c CHGOBJDA_DATE '04.06.2026';

