     h COPYRIGHT('V1.1 - 06.12.2018 - mailto:thomas.raddatz@tools400.de')
      *
     d CHGOBJDA_VERSION...
     d                 C                   '1.1'
     d CHGOBJDA_DATE...
     d                 C                   '06.12.2018'

